myproj/src/main/resources/prepped.msg

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope">
	<SOAP-ENV:Body>
		<EnumValutesXML xmlns="http://web.cbr.ru/">
			<Seld>true</Seld>
		</EnumValutesXML>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>